---
kind: property
id: P:Autodesk.Revit.DB.ParameterDownloadOptions.IsInstance
source: html/b32b52ba-7e42-f0fc-eca0-3d3afdbbf8c6.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.IsInstance Property

True if binding to Element instances, false if binding to Element types.

## Syntax (C#)
```csharp
public bool IsInstance { get; set; }
```